{
	"apps": [{
		"name": "Global Prime Discord Bot",
		"script": "js/globalprimediscordbot.js",
		"time": true,
		"watch": true,
		"ignore-watch": ["node_modules", "logs"],
		"watch_options": {
			"followSymlinks": false
		}
	}],
	"environment": "DEV",
	"slackWebhookUrl":"",
	"prefix": "!",	
	"DEVtoken": "",	
	"DEVEndpoint": "http://localhost:55682",
	"DEVBooxApiHMACAppId": "",
	"DEVBooxApiHMACAppKey": "",
	"PRODtoken": "",
	"PRODEndpoint": "http://localhost:55682",
	"PRODBooxApiHMACAppId": "",
	"PRODBooxApiHMACAppKey": "",
	"AllowedGuilds": ["537092386824912898", "732102588031565914", "748131373679902800", "724474629720113202"],
	"Admins": ["329489566664884224"],
	"welcomeMessages": ["DiscordUser123 just joined the server - glhf!","DiscordUser123 just joined. Everyone look busy!", "DiscordUser123 joined the party.","Ermagherd. DiscordUser123 is here.","Welcome DiscordUser123. Stay awhile and listen.","Welcome DiscordUser123. We were expecting you ( ͡° ͜ʖ ͡°)","Welcome DiscordUser123. We hope you brought pizza.","Welcome DiscordUser123. Leave your weapons by the door.","A wild DiscordUser123 appeared.","Swoooosh. DiscordUser123 just landed.","Brace yourselves. DiscordUser123 just joined the server.","DiscordUser123 just joined. Hide your bananas.","DiscordUser123 just arrived. Seems OP - please nerf.","DiscordUser123 just slid into the server.","A DiscordUser123 has spawned in the server.","Big DiscordUser123 showed up!","Where's DiscordUser123? In the server!","DiscordUser123 hopped into the server. Kangaroo!!","DiscordUser123 just showed up. Hold my beer.","Challenger approaching - DiscordUser123 has appeared!","It's a bird! It's a plane! Nevermind, it's just DiscordUser123.","It's DiscordUser123! Praise the sun! [T]/","Never gonna give DiscordUser123 up. Never gonna let DiscordUser123 down.","Ha! DiscordUser123 has joined! You activated my trap card!","Hey! Listen! DiscordUser123 has joined!","We've been expecting you DiscordUser123","It's dangerous to go alone, take DiscordUser123!","DiscordUser123 has joined the server! It's super effective!","Cheers,love! DiscordUser123 is here!","DiscordUser123 is here, as the prophecy foretold.","DiscordUser123 has arrived. Party's starting.","Ready player DiscordUser123","DiscordUser123 is here to kick butt","Hello. Is it DiscordUser123 you're looking for?","DiscordUser123 has joined. Stay a while and listen!","Roses are red, violets are blue, DiscordUser123 joined this server with you"],
	"GPcolor": "#CEFF32",
	"CompetitorBrokers": ["ic", "icm", "icmarkets", "ic markets"],
	"Confirms":["y", "yes", "yup", "yeah", "yeh"],
	"Denies":["n", "no", "nup", "nope", "fuck no"],
	"GPBotId":"",
	"MEE6BotId": "",
	"GlobalPrimeBotChannelId": "",
	"VerificationChannelId": "",
	"CompetitionsChannelId": "",
	"sArmyChannelId": "",
	"GregsChannelRoleId": "",
	"GhostRiderChannelRoleId": "",
	"ManojChannelRoleId": "",
	"AlexChannelRoleId": "",
	"IvanChannelRoleId": "",
	"RedRoleId" : "",
	"sArmyRoleId" : "",
	"GregRubinUser": "",
	"GhostRiderUser": "",
	"AdminUser": "",
	"JemUser" : "",
	"ManojUser" : "",
	"AlexUser" : "",
	"IvanUser" : "",
	"mentorGuild" : "",
	"GPGuild" : "",
	"A$ASGuild" : "",
	"GPTeamRoleId" : "",
	"mentorDisclaimerChannel" : "",
	"chooseYourMentorChannel" : "",
	"GregInviteMessageId": "",
	"GhostRiderInviteMessageId": "",
	"IvanInviteMessageId": "",
	"ManojInviteMessageId": "",
	"AlexInviteMessageId": "",
	"GregGeneralChannel": "",	
	"GhostRiderGeneralChannel": "",
	"IvanGeneralChannel" : "",
	"AlexGeneralChannel": "",
	"IvanMentorRoleEmojis": ["🐶", "🐱", "🐭", "🐹"],	
	"MentorTandCPart1":"By accessing this Global Prime Mentor Rooms (GP-MR), you agree to the following terms and conditions. Please be advised that your continued use of the GP-MR or the information provided herein shall indicate your consent and agreement to these terms and conditions:",
	"MentorTandCPart2":"1. All statements and expressions in the GP-MR are of the nature of general comment and opinions only and are not meant as investment advice or solicitation. Information provided has been prepared without regard to a particularperson's investment objectives, suitability or risk appetite. It is not personal investment advice and neither purports to be, nor is intended to be, specific trading advice. Furthermore, this information or statements should not be considered as an offer or enticement to buy, sell or trade.",
	"MentorTandCPart3":"2. There is no assurance as to the accuracy or completeness of the information provided. Users of the GP-MR agree that Global Prime Pty Ltd, its directors and its affiliates will not be liable to any person or entity for the quality, accuracy, completeness, reliability, or timeliness of the information provided on theGP-MR,or for any direct, indirect, consequential, incidental, special or punitive damages that may arise out of the use of information we provide to any person or entity (including, but not limited to, lost profits, loss of opportunities, trading losses, and damages that may result from any inaccuracy or incompleteness of this information).",
	"MentorTandCPart4":"3. Trading involves substantial risk, and only those that have resources which they can afford to lose should trade. Global Prime Pty Ltd, its directors and its affiliatesdo not in any way guarantee that the information contained on theGP-MRwill generate profits for the User. By using theGP-MRthe User agrees to not hold liable Global Prime Pty Ltd, its directors, its affiliates or other users for losses the User may sustain while trading instruments, trading signals or trade recommendations discussed, recommend or alluded to on the GP-MR.",
	"MentorTandCPart5":"4. Abuse of any kind will not be tolerated on theGP-MR. Abuse includes but is not limited to verbal or written abuse of the Global Prime Pty Ltd, its directors and its affiliates; attempting to access privileged information not granted to the User or spreading security-specific information in an attempt to manipulate the price of a financial instrument. Any of these actions or other actions will be deemed by theGP-MRto be abusive or illegal in nature and could result in an immediate banof the User from using theGP-MR. The User agrees not to take legal action against Global Prime Pty Ltd, its directors and its affiliates or management, or take any legal action that my directly or indirectly cause legal action to be taken against Global Prime Pty Ltd, its directors and its affiliates or management based on such disciplinary action and the User's only course of action is to cease using the GP-MR.",
	"MentorTandCPart6":"5. All information contained on theGP-MRis the property of Global Prime Pty Ltd and may not be distributed without express consent from Global Prime Pty Ltd.\n6.The GP-MR is not intended for distribution, or use by, any person in any country where such distribution or use would be contrary to local law or regulation. It is the responsibility of users of theGP-MRto ascertain the terms of and comply with any local law or regulation to which they are subject.",
	"MentorTandCPart7":"6. Trading derivatives is high risk. Losses can exceed your initial investment. You should only trade with money you can afford to lose. Any Information or advice contained on theGP-MRis general in nature and has been prepared without taking into account your objectives, financial situation or needs. Past performance of any product described on the GP-MR is not a reliable indication of future performance. Please read our PDS and other legal documents and ensure you fully understand the risks before you make any trading decisions. We encourage you to seek independent advice. The information on the GP-MR is notintended to be an inducement, offer or solicitation to any person in any country orjurisdiction where such distribution or use would be contrary to local law or regulation.",
	"MentorTandCPart8":"Global Prime Pty Ltd, ABN 74 146 086 017, Global Prime holds an Australian Financial Services Licence (AFSL) to carry on financial services business in Australia, limited to the financial services covered by its AFSL no.385620. Gleneagle Securities PTY Limited trading as Global Prime FX is a registered Vanuatu company (Company Number 40256) and is regulated by the VFSC. Global Prime FX Ltd is a registered Seychelles company (Company Number 8412189-1) and holds a Securities Dealers Licence SD057 issued by the FSA. This website is owned and operated by Global Prime Pty Ltd, ABN 74 146 086 017, Gleneagle Securities PTY Limited trading as Global Prime FX, Vanuatu company (Number 40256) and Global Prime FX Ltd (Company Number 8412189-1)."
}